# Lecture 11 Data Wrangling - Part 1 - Categorical Variables
__Math 3080: Fundamentals of Data Science__

Reading:
* [McKinney, *Python for Data Science*, Chapter 6](https://wesmckinney.com/book/accessing-data)
* Chapter 8

Class notes are found through GitHub. As changes are made, they will automatically be uploaded to GitHub. A link to the repository is on Canvas.

-----
## Outcomes
### Course

### Data Analysis Certification
* Databases: Data joins

-----
## Outline
* Mapping
* One-hot Encoding / Dummy Variables
* Ordinal Encoding

In [3]:
# Create a larger file with multiple HW and Exams and Projects
import pandas as pd
students = pd.read_excel('../Datasets/Gradebook.xlsx', sheet_name='Students')
assignments = pd.read_excel('../Datasets/Gradebook.xlsx', sheet_name='Assignments')
grades = pd.read_excel('../Datasets/Gradebook.xlsx', sheet_name='Grades')

In [4]:
print(students.shape)
students.head()

(50, 10)

,student_id,first_name,last_name,class_year,gpa,major,first_time_student,financial_aid,housing_status,credits_completed
0,1001,Sarah,Jensen,Sophomore,2.87,History,Yes,Yes,On-Campus,79
1,1002,Marcus,Lee,Junior,3.63,Physics,No,Yes,Off-Campus,83
2,1003,Emily,Torres,Junior,3.27,Biology,No,Yes,Off-Campus,51
3,1004,Daniel,Wright,Junior,2.85,English,Yes,No,On-Campus,58
4,1005,Olivia,Patel,Sophomore,3.21,Business,No,Yes,Off-Campus,26

In [5]:
print(assignments.shape)
assignments.head()

(23, 3)

  assignment_id assignment_name  category
0            A1      Homework 1  Homework
1            A2      Homework 2  Homework
2            A3      Homework 3  Homework
3            A4      Homework 4  Homework
4            A5      Homework 5  Homework

In [6]:
print(grades.shape)
grades.head()

(1150, 3)

   student_id assignment_id  grade
0        1001            A1    100
1        1035            A1    100
2        1002            A1     99
3        1030            A1     98
4        1021            A1     97

## Concatenate data

Let's say we have a couple new students move in. We need to add their data to the students dataframe.

In [17]:
new_students = pd.DataFrame({
    'student_id' : [1101, 1102, 1103],
    'first_name' : ['John', 'Jill', 'Jim'],
    'last_name' : ['Anderson', 'Benson', 'Kent'],
    'class_year' : ['Senior', 'Freshman', 'Sophomore'],
    'gpa' : [3.41, 2.77, 3.87],
    'major' : ['Physics', 'Biology', 'English'],
    'first_time_student' : ['Yes', 'Yes', 'Yes'],
    'financial_aid' : ['Yes', 'Yes', 'Yes'],
    'housing_status' : ['On-Campus', 'On-Campus', 'Off-Campus'],
    'credits_completed' : [82, 7, 16]
})

new_students

,student_id,first_name,last_name,class_year,gpa,major,first_time_student,financial_aid,housing_status,credits_completed
0,1101,John,Anderson,Senior,3.41,Physics,Yes,Yes,On-Campus,82
1,1102,Jill,Benson,Freshman,2.77,Biology,Yes,Yes,On-Campus,7
2,1103,Jim,Kent,Sophomore,3.87,English,Yes,Yes,Off-Campus,16

In [18]:
pd.concat([students, new_students], axis=0)

,student_id,first_name,last_name,class_year,gpa,major,first_time_student,financial_aid,housing_status,credits_completed
0,1001,Sarah,Jensen,Sophomore,2.87,History,Yes,Yes,On-Campus,79
1,1002,Marcus,Lee,Junior,3.63,Physics,No,Yes,Off-Campus,83
2,1003,Emily,Torres,Junior,3.27,Biology,No,Yes,Off-Campus,51
3,1004,Daniel,Wright,Junior,2.85,English,Yes,No,On-Campus,58
4,1005,Olivia,Patel,Sophomore,3.21,Business,No,Yes,Off-Campus,26
5,1006,Jason,Kim,Freshman,3.11,History,No,Yes,Off-Campus,66
6,1007,Hannah,Brooks,Senior,3.77,Engineering,Yes,No,Off-Campus,78
7,1008,Tyler,Nguyen,Senior,3.45,Chemistry,No,Yes,Off-Campus,20
8,1009,Chloe,Ramirez,Freshman,2.70,Biology,No,No,On-Campus,81
9,1010,Aiden,Foster,Senior,2.72,Biology,Yes,No,Off-Campus,54
10,1011,Mia,Sanders,Sophomore,2.84,Psychology,No,No,Off-Campus,91
11,1012,Logan,Price,Junior,3.82,Chemistry,Yes,Yes,On-Campus,72
12,1013,Zoe,Mitchell,Senior,3.67,Biology,No,Yes,Off-Campus,42
13,1014,Ethan,Ward,Junior,3.80,Chemistry,Yes,Yes,Off-Campus,21
14,1015,Lily,Adams,Sophomore,3.32,Psychology,No,No,On-Campus,56
15,1016,Carter,Bell,Freshman,2.54,Psychology,No,No,On-Campus,40
16,1017,Grace,Cooper,Senior,2.77,Computer Science,Yes,Yes,On-Campus,30
17,1018,Noah,Murphy,Freshman,3.01,Engineering,No,No,On-Campus,81
18,1019,Avery,Rivera,Junior,2.87,Biology,Yes,No,Off-Campus,80
19,1020,Jack,Cox,Sophomore,2.50,Mathematics,Yes,Yes,Off-Campus,49
20,1021,Stella,Howard,Senior,3.52,Physics,Yes,Yes,On-Campus,96
21,1022,Wyatt,Ward,Sophomore,3.82,Computer Science,Yes,No,On-Campus,34
22,1023,Nora,Hughes,Junior,3.26,History,Yes,No,Off-Campus,68
23,1024,Leo,Bryant,Sophomore,3.50,English,No,Yes,On-Campus,48
24,1025,Aria,Flores,Senior,2.81,Statistics,No,No,Off-Campus,79
25,1026,Henry,Simmons,Sophomore,3.62,Chemistry,Yes,No,On-Campus,37
26,1027,Ellie,Butler,Freshman,3.14,Physics,Yes,No,On-Campus,64
27,1028,Gabriel,Jenkins,Junior,2.63,Engineering,No,Yes,Off-Campus,69
28,1029,Scarlett,Perry,Junior,3.76,Business,No,No,Off-Campus,46
29,1030,Julian,Powell,Freshman,2.70,Physics,No,Yes,On-Campus,28
30,1031,Penelope,Long,Freshman,2.74,Sociology,No,Yes,On-Campus,38
31,1032,Eli,Patterson,Sophomore,2.85,Engineering,No,No,On-Campus,24
32,1033,Victoria,Hughes,Sophomore,2.84,Statistics,No,No,Off-Campus,52
33,1034,Owen,Barnes,Sophomore,3.44,English,No,Yes,Off-Campus,60
34,1035,Mila,Ross,Senior,3.64,English,No,Yes,On-Campus,96
35,1036,Isaac,Henderson,Sophomore,3.82,Computer Science,Yes,Yes,On-Campus,89
36,1037,Layla,Coleman,Sophomore,3.88,Computer Science,No,Yes,Off-Campus,99
37,1038,Sebastian,Perry,Senior,2.85,Chemistry,Yes,No,Off-Campus,79
38,1039,Riley,Jenkins,Senior,3.79,Psychology,No,No,On-Campus,21
39,1040,Caleb,Bryant,Sophomore,3.30,Biology,Yes,No,On-Campus,45
40,1041,Paisley,Simmons,Freshman,3.02,Business,No,Yes,On-Campus,14
41,1042,Luke,Butler,Senior,3.71,Engineering,No,Yes,Off-Campus,81
42,1043,Audrey,Powell,Junior,3.09,Psychology,No,No,On-Campus,19
43,1044,Matthew,Flores,Senior,3.85,History,Yes,No,Off-Campus,77
44,1045,Claire,Cox,Junior,3.70,Statistics,Yes,Yes,Off-Campus,43
45,1046,Andrew,Howard,Senior,2.52,English,No,No,On-Campus,60
46,1047,Brooklyn,Ward,Sophomore,2.54,Engineering,Yes,No,Off-Campus,86
47,1048,Thomas,Hughes,Freshman,2.77,Engineering,Yes,No,On-Campus,72
48,1049,Hailey,Adams,Freshman,2.67,Chemistry,No,Yes,Off-Campus,94
49,1050,Benjamin,Wright,Senior,3.96,Chemistry,No,Yes,Off-Campus,49
0,1101,John,Anderson,Senior,3.41,Physics,Yes,Yes,On-Campus,82
1,1102,Jill,Benson,Freshman,2.77,Biology,Yes,Yes,On-Campus,7
2,1103,Jim,Kent,Sophomore,3.87,English,Yes,Yes,Off-Campus,16

Now, let's say that in the assignments folder, we want to identify which segment of the course it is assigned in. Let's say the course is broken into 4 segments. We can do this in two ways:

In [23]:
segments = pd.Series([1,1,1,2,2,2,2,3,3,3,3,4,4,4,4,1,1,2,3,3,4,2,4])
pd.concat([assignments, segments], axis=1)

   assignment_id        assignment_name          category  0
0             A1             Homework 1          Homework  1
1             A2             Homework 2          Homework  1
2             A3             Homework 3          Homework  1
3             A4             Homework 4          Homework  2
4             A5             Homework 5          Homework  2
5             A6             Homework 6          Homework  2
6             A7             Homework 7          Homework  2
7             A8             Homework 8          Homework  3
8             A9             Homework 9          Homework  3
9            A10            Homework 10          Homework  3
10           A11            Homework 11          Homework  3
11           A12            Homework 12          Homework  4
12           A13            Homework 13          Homework  4
13           A14            Homework 14          Homework  4
14           A15            Homework 15          Homework  4
15            P1  Data Cleaning Project  Computer Project  1
16            P2      Wrangling Project  Computer Project  1
17            P3       Graphing Project  Computer Project  2
18            P4     Regression Project  Computer Project  3
19            P5     Evaluation Project  Computer Project  3
20            P6          Final Project  Computer Project  4
21            E1           Midterm Exam              Exam  2
22            E2             Final Exam              Exam  4

In [24]:
assignments['segment'] = segments
assignments

   assignment_id        assignment_name          category  segment
0             A1             Homework 1          Homework        1
1             A2             Homework 2          Homework        1
2             A3             Homework 3          Homework        1
3             A4             Homework 4          Homework        2
4             A5             Homework 5          Homework        2
5             A6             Homework 6          Homework        2
6             A7             Homework 7          Homework        2
7             A8             Homework 8          Homework        3
8             A9             Homework 9          Homework        3
9            A10            Homework 10          Homework        3
10           A11            Homework 11          Homework        3
11           A12            Homework 12          Homework        4
12           A13            Homework 13          Homework        4
13           A14            Homework 14          Homework        4
14           A15            Homework 15          Homework        4
15            P1  Data Cleaning Project  Computer Project        1
16            P2      Wrangling Project  Computer Project        1
17            P3       Graphing Project  Computer Project        2
18            P4     Regression Project  Computer Project        3
19            P5     Evaluation Project  Computer Project        3
20            P6          Final Project  Computer Project        4
21            E1           Midterm Exam              Exam        2
22            E2             Final Exam              Exam        4

## Mapping

Let's map the assignment type from the assignments sheet onto the grades sheet.

In [8]:
hw_dict = pd.Series(assignments['category'].values, index=assignments['assignment_id']).to_dict()
hw_dict

{'A1': 'Homework',
 'A2': 'Homework',
 'A3': 'Homework',
 'A4': 'Homework',
 'A5': 'Homework',
 'A6': 'Homework',
 'A7': 'Homework',
 'A8': 'Homework',
 'A9': 'Homework',
 'A10': 'Homework',
 'A11': 'Homework',
 'A12': 'Homework',
 'A13': 'Homework',
 'A14': 'Homework',
 'A15': 'Homework',
 'P1': 'Computer Project',
 'P2': 'Computer Project',
 'P3': 'Computer Project',
 'P4': 'Computer Project',
 'P5': 'Computer Project',
 'P6': 'Computer Project',
 'E1': 'Exam',
 'E2': 'Exam'}

In [9]:
grades['category'] = grades['assignment_id'].map(hw_dict)
grades.head()

   student_id assignment_id  grade  category
0        1001            A1    100  Homework
1        1035            A1    100  Homework
2        1002            A1     99  Homework
3        1030            A1     98  Homework
4        1021            A1     97  Homework

## One-hot Encoding

When sending data into a model, it will need numerical variables. So, we need to convert categorical variables into numerical variables that represent those categories. This process is known as __encoding__.

For Nominal variables, we use __one-hot encoding__ (in Pandas, we use the `pd.get_dummies()` function to do this). It creates one column for each category and then gives it a value of 1 if the observation is in that category and a 0 if it is not.

Let's do this for the students' major in the `students` dataset.

In [27]:
students.head()

,student_id,first_name,last_name,class_year,gpa,major,first_time_student,financial_aid,housing_status,credits_completed,Freshman,Junior,Senior,Sophomore,Freshman,Junior,Senior,Sophomore
0,1001,Sarah,Jensen,Sophomore,2.87,History,Yes,Yes,On-Campus,79,0,0,0,1,0,0,0,1
1,1002,Marcus,Lee,Junior,3.63,Physics,No,Yes,Off-Campus,83,0,1,0,0,0,1,0,0
2,1003,Emily,Torres,Junior,3.27,Biology,No,Yes,Off-Campus,51,0,1,0,0,0,1,0,0
3,1004,Daniel,Wright,Junior,2.85,English,Yes,No,On-Campus,58,0,1,0,0,0,1,0,0
4,1005,Olivia,Patel,Sophomore,3.21,Business,No,Yes,Off-Campus,26,0,0,0,1,0,0,0,1

In [28]:
major_dummies = pd.get_dummies(students['major']).astype(int)
major_dummies.head()

,Biology,Business,Chemistry,Computer Science,Engineering,English,History,Mathematics,Physics,Psychology,Sociology,Statistics
0,0,0,0,0,0,0,1,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0,0
2,1,0,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,1,0,0,0,0,0,0
4,0,1,0,0,0,0,0,0,0,0,0,0

How do we add this onto the original dataset? We need to concatenate them.

In [29]:
students = pd.concat([students, major_dummies], axis=1)
students.head(7)

,student_id,first_name,last_name,class_year,gpa,major,first_time_student,financial_aid,housing_status,credits_completed,...,Chemistry,Computer Science,Engineering,English,History,Mathematics,Physics,Psychology,Sociology,Statistics
0,1001,Sarah,Jensen,Sophomore,2.87,History,Yes,Yes,On-Campus,79,...,0,0,0,0,1,0,0,0,0,0
1,1002,Marcus,Lee,Junior,3.63,Physics,No,Yes,Off-Campus,83,...,0,0,0,0,0,0,1,0,0,0
2,1003,Emily,Torres,Junior,3.27,Biology,No,Yes,Off-Campus,51,...,0,0,0,0,0,0,0,0,0,0
3,1004,Daniel,Wright,Junior,2.85,English,Yes,No,On-Campus,58,...,0,0,0,1,0,0,0,0,0,0
4,1005,Olivia,Patel,Sophomore,3.21,Business,No,Yes,Off-Campus,26,...,0,0,0,0,0,0,0,0,0,0
5,1006,Jason,Kim,Freshman,3.11,History,No,Yes,Off-Campus,66,...,0,0,0,0,1,0,0,0,0,0
6,1007,Hannah,Brooks,Senior,3.77,Engineering,Yes,No,Off-Campus,78,...,0,0,1,0,0,0,0,0,0,0

## Ordinal Encoding

For Ordinal variables, we can depict the category with a number scale (for example, pain level is often represented "on a scale from 1 to 10"). We can easily use this with mapping on our class level for each student.

In [32]:
classes = {
    'Freshman' : 1,
    'Sophomore' : 2,
    'Junior' : 3,
    'Senior' : 4
}

students['class_num'] = students['class_year'].map(classes)
students.head(7)

,student_id,first_name,last_name,class_year,gpa,major,first_time_student,financial_aid,housing_status,credits_completed,...,Computer Science,Engineering,English,History,Mathematics,Physics,Psychology,Sociology,Statistics,class_num
0,1001,Sarah,Jensen,Sophomore,2.87,History,Yes,Yes,On-Campus,79,...,0,0,0,1,0,0,0,0,0,2
1,1002,Marcus,Lee,Junior,3.63,Physics,No,Yes,Off-Campus,83,...,0,0,0,0,0,1,0,0,0,3
2,1003,Emily,Torres,Junior,3.27,Biology,No,Yes,Off-Campus,51,...,0,0,0,0,0,0,0,0,0,3
3,1004,Daniel,Wright,Junior,2.85,English,Yes,No,On-Campus,58,...,0,0,1,0,0,0,0,0,0,3
4,1005,Olivia,Patel,Sophomore,3.21,Business,No,Yes,Off-Campus,26,...,0,0,0,0,0,0,0,0,0,2
5,1006,Jason,Kim,Freshman,3.11,History,No,Yes,Off-Campus,66,...,0,0,0,1,0,0,0,0,0,1
6,1007,Hannah,Brooks,Senior,3.77,Engineering,Yes,No,Off-Campus,78,...,0,1,0,0,0,0,0,0,0,4

## Joins

## Pivot Tables

## Melting

## Groupbys